# 1. Tratamiento de datos

## 1.1.1 Carga de datos:

Disponemos de 4 ficheros csv que contienen los datos con los que construir la base de datos:
- `clase_1.csv` y `clase_2.csv` contienen los datos de los alumnos pertenecientes al bootcamp de *Data Science*.
- `clase_3.csv` y `clase_3.csv` contienen los datos de los alumnos pertenecientes al bootcamp de *Full Stack*.
- `claustro.csv` contiene los datos del claustro de profesores.

Echemos un vistazo al contenido de los csv:

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("data/clase_1.csv", sep = ';')
df2 = pd.read_csv("data/clase_2.csv", sep = ';')
df3 = pd.read_csv("data/clase_3.csv", sep = ';')
df4 = pd.read_csv("data/clase_4.csv", sep = ';')
df_claustro = pd.read_csv("data/claustro.csv", sep = ';')

In [3]:
df1.head(1)

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto

In [4]:
df2.head(1)

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Guillermo Borrego,Guillermo_Borrego@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,No Apto,Apto,No Apto

In [5]:
df3.head(1)

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullSatck
0,Amor Larrañaga,Amor_Larrañaga@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,Apto,No Apto

In [6]:
df4.head(1)

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullSatck
0,Teresa Laguna,Teresa_Laguna@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,Apto,Apto,Apto

In [7]:
df_claustro

               Nombre Rol Vertical   Promocion    Campus   Modalidad
0           Noa Yáñez  TA       DS  Septiembre    Madrid  Presencial
1   Saturnina Benitez  TA       DS  Septiembre    Madrid  Presencial
2          Anna Feliu  TA       FS  Septiembre    Madrid  Presencial
3       Rosalva Ayuso  TA       FS  Septiembre  Valencia  Presencial
4    Ana Sofía Ferrer  TA       FS     Febrero  Valencia  Presencial
5     Angélica Corral  TA       FS     Febrero    Madrid  Presencial
6         Ariel Lledó  TA       DS  Septiembre    Madrid  Presencial
7         Mario Prats  LI       FS     Febrero  Valencia      Online
8   Luis Ángel Suárez  LI       FS  Septiembre    Madrid      Online
9  María Dolores Diaz  LI       DS  Septiembre    Madrid      Online

### 1.1.2 Agrupación de datos:

**TABLA TOTAL:**

In [8]:
df_total = pd.concat([df1, df2, df3, df4], ignore_index = True)

## 1.2 Agrupación de datos:

Antes de subir las tablas a la **Base de Datos**, vamos a generar los DataFrames en los que agrupar los datos.

### 1.2.1 Tablas sin Foreign Keys:

#### 1.2.1.1 Vertical:

**Tabla X**: Vertical

Distintos Bootcamps que ofrece The Bridge.

In [54]:
df_vertical = pd.DataFrame({
    "bootcamp": df_claustro["Vertical"].unique()
})
df_vertical.reset_index(names = "id_vertical", inplace = True)
df_vertical

   id_vertical bootcamp
0            0       DS
1            1       FS

#### 1.2.1.2 Promoción:

In [10]:
df_promo = df_total[["Promoción", "Fecha_comienzo"]].drop_duplicates().reset_index(drop = True)
df_promo.reset_index(names = "id_promocion", inplace = True)
df_promo

   id_promocion   Promoción Fecha_comienzo
0             0  Septiembre     18/09/2023
1             1     Febrero     12/02/2024

#### 1.2.1.3 Campus:

In [11]:
 df_campus = pd.DataFrame({
    "ubicacion": df_claustro["Campus"].unique(),
})
df_campus.reset_index(names = "id_campus", inplace = True)
df_campus

   id_campus ubicacion
0          0    Madrid
1          1  Valencia

#### 1.2.1.4 Proyecto:

In [12]:
df_proyecto = pd.DataFrame({
    "nombre_proyecto": [elem for elem in df_total.columns if "Proyecto" in elem],
})
df_proyecto.reset_index(names = "id_proyecto", inplace = True)
df_proyecto

   id_proyecto      nombre_proyecto
0            0         Proyecto_HLF
1            1         Proyecto_EDA
2            2        Proyecto_BBDD
3            3          Proyecto_ML
4            4  Proyecto_Deployment
5            5      Proyecto_WebDev
6            6    Proyecto_FrontEnd
7            7     Proyecto_Backend
8            8       Proyecto_React
9            9   Proyecto_FullSatck

#### 1.2.1.5 Profesorado:

In [13]:
df_profesorado = df_claustro[["Nombre", "Rol"]]
df_profesorado.reset_index(names = "id_profesor", inplace = True)
df_profesorado

   id_profesor              Nombre Rol
0            0           Noa Yáñez  TA
1            1   Saturnina Benitez  TA
2            2          Anna Feliu  TA
3            3       Rosalva Ayuso  TA
4            4    Ana Sofía Ferrer  TA
5            5     Angélica Corral  TA
6            6         Ariel Lledó  TA
7            7         Mario Prats  LI
8            8   Luis Ángel Suárez  LI
9            9  María Dolores Diaz  LI

### 1.2.2 Tablas con Foreign Keys:

#### 1.2.2.1 Clase:

Partiremos del DataFrame df_claustro (creado a partir del fichero *claustro.csv*). Primero, haremos merge con el DataFrame del vertical:

In [16]:
df_claustro

               Nombre Rol Vertical   Promocion    Campus   Modalidad
0           Noa Yáñez  TA       DS  Septiembre    Madrid  Presencial
1   Saturnina Benitez  TA       DS  Septiembre    Madrid  Presencial
2          Anna Feliu  TA       FS  Septiembre    Madrid  Presencial
3       Rosalva Ayuso  TA       FS  Septiembre  Valencia  Presencial
4    Ana Sofía Ferrer  TA       FS     Febrero  Valencia  Presencial
5     Angélica Corral  TA       FS     Febrero    Madrid  Presencial
6         Ariel Lledó  TA       DS  Septiembre    Madrid  Presencial
7         Mario Prats  LI       FS     Febrero  Valencia      Online
8   Luis Ángel Suárez  LI       FS  Septiembre    Madrid      Online
9  María Dolores Diaz  LI       DS  Septiembre    Madrid      Online

In [17]:
df_vertical

   vertical_id bootcamp
0            0       DS
1            1       FS

In [38]:
a = pd.merge(df_claustro, df_vertical, left_on = "Vertical", right_on = "bootcamp")
#a = a.drop("Vertical", axis = 1)
a = a.drop(["Vertical", "bootcamp"], axis = 1)
a

               Nombre Rol   Promocion    Campus   Modalidad  vertical_id
0           Noa Yáñez  TA  Septiembre    Madrid  Presencial            0
1   Saturnina Benitez  TA  Septiembre    Madrid  Presencial            0
2          Anna Feliu  TA  Septiembre    Madrid  Presencial            1
3       Rosalva Ayuso  TA  Septiembre  Valencia  Presencial            1
4    Ana Sofía Ferrer  TA     Febrero  Valencia  Presencial            1
5     Angélica Corral  TA     Febrero    Madrid  Presencial            1
6         Ariel Lledó  TA  Septiembre    Madrid  Presencial            0
7         Mario Prats  LI     Febrero  Valencia      Online            1
8   Luis Ángel Suárez  LI  Septiembre    Madrid      Online            1
9  María Dolores Diaz  LI  Septiembre    Madrid      Online            0

Después, haremos merge con el DataFrame del profesorado:

In [41]:
b = pd.merge(a, df_profesorado, on = "Nombre")
b.drop(["Nombre", "Rol_x", "Rol_y"], axis = 1, inplace = True)
b

    Promocion    Campus   Modalidad  vertical_id  id_profesor
0  Septiembre    Madrid  Presencial            0            0
1  Septiembre    Madrid  Presencial            0            1
2  Septiembre    Madrid  Presencial            1            2
3  Septiembre  Valencia  Presencial            1            3
4     Febrero  Valencia  Presencial            1            4
5     Febrero    Madrid  Presencial            1            5
6  Septiembre    Madrid  Presencial            0            6
7     Febrero  Valencia      Online            1            7
8  Septiembre    Madrid      Online            1            8
9  Septiembre    Madrid      Online            0            9

A continuación, haremos merge con el DataFrame del campus:

In [21]:
df_campus

   id_campus ubicacion
0          0    Madrid
1          1  Valencia

In [43]:
c = pd.merge(b, df_campus, left_on = "Campus", right_on = "ubicacion")
c.drop(["Campus", "ubicacion"], axis = 1, inplace = True)
c

    Promocion   Modalidad  vertical_id  id_profesor  id_campus
0  Septiembre  Presencial            0            0          0
1  Septiembre  Presencial            0            1          0
2  Septiembre  Presencial            1            2          0
3  Septiembre  Presencial            1            3          1
4     Febrero  Presencial            1            4          1
5     Febrero  Presencial            1            5          0
6  Septiembre  Presencial            0            6          0
7     Febrero      Online            1            7          1
8  Septiembre      Online            1            8          0
9  Septiembre      Online            0            9          0

**Finalmente**, haremos merge con el DataFrame de la promoción:

In [27]:
df_promo

   id_promocion   Promoción Fecha_comienzo
0             0  Septiembre     18/09/2023
1             1     Febrero     12/02/2024

In [46]:
d = pd.merge(c, df_promo, left_on = "Promocion", right_on = "Promoción")
d.drop(["Promocion", "Promoción", "Fecha_comienzo"], axis = 1, inplace = True)
d

    Modalidad  vertical_id  id_profesor  id_campus  id_promocion
0  Presencial            0            0          0             0
1  Presencial            0            1          0             0
2  Presencial            1            2          0             0
3  Presencial            1            3          1             0
4  Presencial            1            4          1             1
5  Presencial            1            5          0             1
6  Presencial            0            6          0             0
7      Online            1            7          1             1
8      Online            1            8          0             0
9      Online            0            9          0             0

In [57]:
d = d[["id_campus", "id_profesor", "id_promocion", "vertical_id", "Modalidad"]] # Reordenamos las columnas

# Creamos un diccionario para cambiar el nombre de las columnas
rename = {
    "id_campus": "campus_id",
    "id_profesor": "profesor_id",
    "id_promocion": "promocion_id",
    "id_vertical": "vertical_id"
}

df_clase = d.rename(mapper = rename, axis = 1)


df_clase = df_clase.reset_index(names = "id_clase")
df_clase

   id_clase  campus_id  profesor_id  promocion_id  vertical_id   Modalidad
0         0          0            0             0            0  Presencial
1         1          0            1             0            0  Presencial
2         2          0            2             0            1  Presencial
3         3          1            3             0            1  Presencial
4         4          1            4             1            1  Presencial
5         5          0            5             1            1  Presencial
6         6          0            6             0            0  Presencial
7         7          1            7             1            1      Online
8         8          0            8             0            1      Online
9         9          0            9             0            0      Online

#### 1.2.2.2 Cuadrante:

Hay que usar merge con las tablas **Profesorado** y **Clase**.

In [59]:
df_profesorado

   id_profesor              Nombre Rol
0            0           Noa Yáñez  TA
1            1   Saturnina Benitez  TA
2            2          Anna Feliu  TA
3            3       Rosalva Ayuso  TA
4            4    Ana Sofía Ferrer  TA
5            5     Angélica Corral  TA
6            6         Ariel Lledó  TA
7            7         Mario Prats  LI
8            8   Luis Ángel Suárez  LI
9            9  María Dolores Diaz  LI

#### 1.2.2.3 Alumno:

In [70]:
e = pd.concat([df1, df2], ignore_index = True)
e["bootcamp"] = "DS"
pd.merge(e, df_vertical, on = "bootcamp")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Nombre               25 non-null     object
 1   Email                25 non-null     object
 2   Promoción            25 non-null     object
 3   Fecha_comienzo       25 non-null     object
 4   Campus               25 non-null     object
 5   Proyecto_HLF         25 non-null     object
 6   Proyecto_EDA         25 non-null     object
 7   Proyecto_BBDD        25 non-null     object
 8   Proyecto_ML          25 non-null     object
 9   Proyecto_Deployment  25 non-null     object
 10  bootcamp             25 non-null     object
dtypes: object(11)
memory usage: 2.3+ KB

In [71]:
df_vertical.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_vertical  2 non-null      int64
 1   bootcamp     2 non-null      object
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes